essele/Fluke_Z8_Emulator/PSoC_Workspace/Fluke Z8 Emulator.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Clock_1.h"
#include "XTAL1.h"
#include "XTAL1_aliases.h"
#include "PWM_1.h"
#include "CTRL1.h"
#include "CTRL2.h"
#include "P1.h"
#include "P1_aliases.h"
#include "DATA1.h"
#include "Clock_2.h"
#include "DS.h"
#include "DS_aliases.h"
#include "RW.h"
#include "RW_aliases.h"
#include "AS.h"
#include "AS_aliases.h"
#include "P0.h"
#include "P0_aliases.h"
#include "P0H.h"
#include "P0H_aliases.h"
#include "P2.h"
#include "P2_aliases.h"
#include "DM.h"
#include "DM_aliases.h"
#include "P35.h"
#include "P35_aliases.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "P31.h"
#include "P31_aliases.h"
#include "P30.h"
#include "P30_aliases.h"
#include "Timer_1.h"
#include "P36.h"
#include "P36_aliases.h"
#include "UART_SCBCLK.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

